# Challenge Questions - TfL Dataset

# Instructions:
• Please ensure you don't overwrite any existing cells. Add new cells below by pressing ALT+ENTER

• Attempt all of the questions

• You are encouraged to look online for help should you need it

# Dataset overview:
There are three datasets stored in the same directory as this Notebook, they are all related to each other:

• **tfl-daily-cycle-hires.csv**: This dataset contains bike hire data from Transport for London during the period 
30th July 2010 to 30th September 2021. 'Day' is the day in '%d/%m/%Y' format. 'Number of Bicycle Hires' is the total number of bikes hired that day.

#

## Import pandas, numpy and datetime

In [1]:
import pandas as pd
import numpy as np
import datetime as dt

## Load the files:
• "tfl-daily-cycle-hires.csv" should be assigned to the variable **tfl**

In [3]:
tfl = pd.read_csv('tfl-daily-cycle-hires.csv')

In [4]:
tfl.head()

          Day  Number of Bicycle Hires  Unnamed: 2
0  30/07/2010                   6897.0         NaN
1  31/07/2010                   5564.0         NaN
2  01/08/2010                   4303.0         NaN
3  02/08/2010                   6642.0         NaN
4  03/08/2010                   7966.0         NaN

## Check the head of the DataFrame

In [5]:
tfl.head()

          Day  Number of Bicycle Hires  Unnamed: 2
0  30/07/2010                   6897.0         NaN
1  31/07/2010                   5564.0         NaN
2  01/08/2010                   4303.0         NaN
3  02/08/2010                   6642.0         NaN
4  03/08/2010                   7966.0         NaN

## Check the data types of the DataFrame columns

In [6]:
tfl.dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

## Change the data types and remove unnecessary columns 

• 'Day' should be a datetime64 data type

• 'Number of Bicycle Hires' should be float64

• Any other columns should be deleted

In [7]:
tfl['Day'] = pd.to_datetime(tfl['Day'], format='%d/%m/%Y')

In [9]:
tfl.dtypes

Day                        datetime64[ns]
Number of Bicycle Hires           float64
Unnamed: 2                        float64
dtype: object

In [10]:
tfl.drop('Unnamed: 2', axis=1, inplace=True)

In [11]:
tfl

            Day  Number of Bicycle Hires
0    2010-07-30                   6897.0
1    2010-07-31                   5564.0
2    2010-08-01                   4303.0
3    2010-08-02                   6642.0
4    2010-08-03                   7966.0
...         ...                      ...
4076 2021-09-26                  45120.0
4077 2021-09-27                  32167.0
4078 2021-09-28                  32539.0
4079 2021-09-29                  39889.0
4080 2021-09-30                  34070.0

[4081 rows x 2 columns]

## What is the average number of bicycle hires per day across the entire dataset?

In [17]:
tfl.iloc[:,1].mean()

np.float64(26261.932124479295)

In [18]:
tfl['Year'] = tfl['Day'].dt.year

In [19]:
tfl

            Day  Number of Bicycle Hires  Year
0    2010-07-30                   6897.0  2010
1    2010-07-31                   5564.0  2010
2    2010-08-01                   4303.0  2010
3    2010-08-02                   6642.0  2010
4    2010-08-03                   7966.0  2010
...         ...                      ...   ...
4076 2021-09-26                  45120.0  2021
4077 2021-09-27                  32167.0  2021
4078 2021-09-28                  32539.0  2021
4079 2021-09-29                  39889.0  2021
4080 2021-09-30                  34070.0  2021

[4081 rows x 3 columns]

## Create a new column called 'Year' which contains the 4 digit year

In [20]:
tfl['Year'] = tfl['Day'].dt.year

## What is the average number of bicycle hires per Year across the entire dataset

In [32]:
tfl.groupby(by = 'Year').head(6)

            Day  Number of Bicycle Hires  Year
0    2010-07-30                   6897.0  2010
1    2010-07-31                   5564.0  2010
2    2010-08-01                   4303.0  2010
3    2010-08-02                   6642.0  2010
4    2010-08-03                   7966.0  2010
...         ...                      ...   ...
3809 2021-01-02                  17560.0  2021
3810 2021-01-03                  13616.0  2021
3811 2021-01-04                  10374.0  2021
3812 2021-01-05                   9566.0  2021
3813 2021-01-06                  12382.0  2021

[72 rows x 3 columns]

In [ ]:
tfl.groupby('Year').mean(6)

      Number of Bicycle Hires
Year
2010             14069.761290
2011             19568.353425
2012             26008.969945
2013             22042.353425
2014             27462.731507
2015             27046.134247
2016             28152.013661
2017             28619.298630
2018             28952.164384
2019             28561.520548
2020             28508.653005
2021             30091.069597

In [25]:
tfl.groupby('Year')['Number of Bicycle Hires'].mean()

Year
2010    14069.761290
2011    19568.353425
2012    26008.969945
2013    22042.353425
2014    27462.731507
2015    27046.134247
2016    28152.013661
2017    28619.298630
2018    28952.164384
2019    28561.520548
2020    28508.653005
2021    30091.069597
Name: Number of Bicycle Hires, dtype: float64

## What is the total number of bicycle hires per Year across the entire dataset

In [31]:
tfl.groupby('Year')['Number of Bicycle Hires'].sum()

Year
2010     2180813.0
2011     7142449.0
2012     9519283.0
2013     8045459.0
2014    10023897.0
2015     9871839.0
2016    10303637.0
2017    10446044.0
2018    10567540.0
2019    10424955.0
2020    10434167.0
2021     8214862.0
Name: Number of Bicycle Hires, dtype: float64

## Create a new column called 'Category' on the tfl DataFrame that classifies the number of bike hires per day as:
* 'Low' if the 'Number of Bicycle Hires' is below 10,000
* 'Medium' if the 'Number of Bicycle Hires' is below 40,000 but greater than or equal to 10,000
* 'High' if the 'Number of Bicycle Hires' is greater than or equal to 40,000

## For each year in the tfl DataFrame how many days are classed as 'Low', 'Medium' or 'High'?